class Msg:
    you_are_not_member_of_channel = "متاسفانه شما عضو کانال نیستید☹️\n" \
                                    "برای استفاده از این بات نیاز است عضو کانال @tanjimestan باشید.\n" \
                                    "لطفا پس از عضو شدن، دوباره درخواست خود را ارسال کنید.😊"
    start = 'سلام ☺️\nیکی از گزینه‌های زیر رو انتخاب کن'
    premium_msg = 'شما میتونید از امکانات ویژه این بات مثل اعلام ساعت قمر در عقرب یک روز قبل بهره‌مند شوید.'


class Btn:
    premium_features = 'امکانات ویژه ⭐️'
    moon_status = 'وضعیت قمر 🌜'
    planets_status = 'وضعیت کواکب 🪐'
